# Data-X Plaksha 2021 Assignment 3: SQL Queries

## Submission details:

Please submit this HW as a Jupyter Notebook and a PDF of your results (both should show output).

For the submision create a local database with `sqlite3` or `sqlalchemy` in a Jupyter notebook and
make the queries either with a cursor object (and then print the results) or by using pandas
`pd.read_sql_query()`

---

When completing this homework you can experiment with SQL commands by utilizing this great online editor:

[https://www.w3schools.com/sql/trysql.asp?filename=trysql_select_all](https://www.w3schools.com/sql/trysql.asp?filename=trysql_select_all)

There are already some tables in the online Database, namely:

> Categories, Employees, OrderDetails, Orders, Products, Shippers, and Suppliers.

We are not going to use them, and if you want you can drop them by running
`DROP TABLE [table-name];` (or just keep them).

In [32]:
import sqlite3
import pandas as pd

# Question 1

In [33]:
conn = sqlite3.connect('dogs.db')

In [34]:
conn.execute("""CREATE TABLE parents (
 parent VARCHAR(20),
 child VARCHAR(20));""")

In [35]:
conn.execute("""INSERT INTO parents (parent, child)
 VALUES ("abraham", "barack") UNION
 VALUES ("abraham", "clinton") UNION
 VALUES ("delano", "herbert") UNION
 VALUES ("fillmore", "abraham") UNION
 VALUES ("fillmore", "delano") UNION
 VALUES ("fillmore", "grover") UNION
 VALUES ("eisenhower", "fillmore");""")

In [36]:
conn.commit()  
# conn.close()

In [38]:
query1_1 = pd.read_sql_query("select * from parents", con=conn)
query1_1

       parent     child
0     abraham    barack
1     abraham   clinton
2      delano   herbert
3  eisenhower  fillmore
4    fillmore   abraham
5    fillmore    delano
6    fillmore    grover

In [39]:
query1_2 = pd.read_sql_query("select child, parent from parents where parent = 'abraham'", con=conn)
query1_2

     child   parent
0   barack  abraham
1  clinton  abraham

In [40]:
query1_3 = pd.read_sql_query("select child from parents where child like '%e%'", con=conn)
query1_3

      child
0   herbert
1  fillmore
2    delano
3    grover

In [41]:
query1_4 = pd.read_sql_query("select distinct parent from parents order by 1 desc", con=conn)
query1_4

       parent
0    fillmore
1  eisenhower
2      delano
3     abraham

In [71]:
query1_5 = pd.read_sql_query("select a.child sibling1, b.child sibling2 \
                            from parents a inner join parents b on a.parent = b.parent \
                            where a.child<b.child group by 1,2", con=conn)
query1_5

  sibling1 sibling2
0  abraham   delano
1  abraham   grover
2   barack  clinton
3   delano   grover

# Question 2

In [42]:
conn.execute("""CREATE TABLE dogs AS
 SELECT "abraham" AS name, "long" AS fur UNION
 SELECT "barack", "short" UNION
 SELECT "clinton", "long" UNION
 SELECT "delano", "long" UNION
 SELECT "eisenhower", "short" UNION
 SELECT "fillmore", "curly" UNION
 SELECT "grover", "short" UNION
 SELECT "herbert", "curly";""")

In [46]:
query2_all = pd.read_sql_query("select * from dogs", con=conn)
query2_all

         name    fur
0     abraham   long
1      barack  short
2     clinton   long
3      delano   long
4  eisenhower  short
5    fillmore  curly
6      grover  short
7     herbert  curly

In [44]:
query2_1 = pd.read_sql_query("select count(*) long_fur_dogs from dogs where fur = 'long'", con=conn)
query2_1

   long_fur_dogs
0              3

In [45]:
query2_2 = pd.read_sql_query("select b.parent from dogs a left join parents b on a.name = b.child where fur = 'curly'", con=conn)
query2_2

       parent
0  eisenhower
1      delano

In [57]:
query2_3 = pd.read_sql_query("select parent, child, b.fur parent_fur, c.fur child_fur \
                            from parents a left join dogs b on a.parent = b.name \
                            left join dogs c on a.child = c.name \
                            where parent_fur = child_fur", con=conn)
query2_3
# b.parent parent, b.child child

    parent    child parent_fur child_fur
0  abraham  clinton       long      long

# Question 3

In [47]:
conn.execute("""create table animals as
 select "dog" as kind, 4 as legs, 20 as weight union
 select "cat" , 4 , 10 union
 select "ferret" , 4 , 10 union
 select "parrot" , 2 , 6 union
 select "penguin" , 2 , 10 union
select "t-rex" , 2 , 12000;""")

In [48]:
query3_all = pd.read_sql_query("select * from animals", con=conn)
query3_all

      kind  legs  weight
0      cat     4      10
1      dog     4      20
2   ferret     4      10
3   parrot     2       6
4  penguin     2      10
5    t-rex     2   12000

In [49]:
query3_1 = pd.read_sql_query("select kind, weight min_weight from animals order by weight limit 1", con=conn)
query3_1

     kind  min_weight
0  parrot           6

In [50]:
query3_2 = pd.read_sql_query("select avg(legs) avg_legs, avg(weight) avg_weight from animals", con=conn)
query3_2

   avg_legs   avg_weight
0       3.0  2009.333333

In [51]:
query3_3 = pd.read_sql_query("select kind, weight, legs from animals where weight<20 and legs>2", con=conn)
query3_3

     kind  weight  legs
0     cat      10     4
1  ferret      10     4

In [52]:
query3_4 = pd.read_sql_query("select legs, avg(weight) from animals group by 1", con=conn)
query3_4

   legs  avg(weight)
0     2  4005.333333
1     4    13.333333